[
    {
        "id":"fayvara1_5",
        "message":"I can teach you about using shields and parrying weapons to your advantage, or how to best use light or heavy armors. I can also teach you how to better handle blows when not wearing any armor at all, fighting unarmored that is.",
        "replies":[
            {
                "text":"N",
                "nextPhraseID":"fayvara1_6"
            }
        ]
    },
    {
        "id":"fayvara1_6",
        "message":"We only have time for one type of armor right now though, so think carefully on which one will suit you best.",
        "replies":[
            {
                "text":"Tell me more about shields and parrying weapons.",
                "nextPhraseID":"fayvara1_7_s"
            },
            {
                "text":"Tell me more about light armor.",
                "nextPhraseID":"fayvara1_7_l"
            },
            {
                "text":"Tell me more about heavy armor.",
                "nextPhraseID":"fayvara1_7_h"
            },
            {
                "text":"Tell me more about fighting without armor.",
                "nextPhraseID":"fayvara1_7_u"
            },
            {
                "text":"I'll be right back.",
                "nextPhraseID":"X"
            }
        ],
        "rewards":[
            {
                "rewardType":"questProgress",
                "rewardID":"charwood1",
                "value":90
            }
        ]
    },
    {
        "id":"fayvara1_7_s",
        "message":"Shields can be used in combination with your regular weapon, to block attacks from your opponent. Parrying weapons are mainly defensive, and can be use to block or divert your opponents strike. They will not block as well as a good shield, but if you know how to use them they can be very effective, and you may be able to do some damage with them.",
        "replies":[
            {
                "text":"N",
                "nextPhraseID":"fayvara1_7_s1"
            }
        ]
    },
    {
        "id":"fayvara1_7_s1",
        "message":"I can teach you to better withstand attacks using a shield, or to divert blows using a parrying weapon, so that you don't take as much damage while using them.",
        "replies":[
            {
                "text":"Sounds good. Teach me about shields and parrying weapons.",
                "nextPhraseID":"fayvara1_7_s2"
            },
            {
                "text":"Let's go back to the other types of armors.",
                "nextPhraseID":"fayvara1_6"
            }
        ]
    }
]